SimuXAI/blog1/sprayFoam_TWC_Reaction_AMR/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// ************************************************************************* //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 0;

boundaryField
{


	sides

	{

		type zeroGradient;


	}
	region0_to_wallFilmRegion_wallFilmFaces
    {
        type                zeroGradient;
    }
}

// ************************************************************************* //
