SimuXAI/blog1/sprayFoam_TWC_Reaction_AMR/constant/foam.inp
species
(
    O2
    H2O
    N2
)
;

reactions
{}
