SimuXAI/blog1/sprayFoam_TWC_Reaction_AMR/constant/wallFilmRegion/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/wallFilmRegion/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    sides
    {
        type            patch;
        nFaces          100;
        startFace       19800;
    }
    wallFilmFaces_top
    {
        type            patch;
        nFaces          10000;
        startFace       19900;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mappedPatch
)
;
        nFaces          10000;
        startFace       29900;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
10000
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
    side1
    {
        type            patch;
        nFaces          100;
        startFace       39900;
    }
    side2
    {
        type            patch;
        nFaces          100;
        startFace       40000;
    }
    side3
    {
        type            patch;
        nFaces          0;
        startFace       40100;
    }
    side4
    {
        type            patch;
        nFaces          100;
        startFace       40100;
    }
)

// ************************************************************************* //
